app/controllers/admin/leaderships_controller.rb

  def index
    @leaderships = Leadership.all
---
SELECT * FROM "leaderships"

  def show
    @leadership = Leadership.find(params[:id])
---
SELECT * FROM "leaderships" WHERE ("leaderships"."id" = 1)

  def edit
    @leadership = Leadership.find(params[:id])
---
SELECT * FROM "leaderships" WHERE ("leaderships"."id" = 1)

  def create
    @leadership = Leadership.new(params[:leadership])

    respond_to do |format|
      if @leadership.save
---
INSERT INTO "leaderships" ("postion", "name", "title", "email", "content_1", "content_2", "created_at", "updated_at") VALUES(NULL, 'Mark Tovey', 'Managing Director', 'mark.tovey@apm.eu.com', 'Mark Tovey has over 20 years experience in infrastructure related projects, including public and private finance deals. Over recent years Mark has been involved in some of the largest PPP and PFI deals in Europe and has a broad range of skills in this specialised field. Key projects include M25 DBFO (£5bn), M59, Network Rail acquisition of Railtrack (£30bn securitised loan), Dutch High Speed Rail (£16bn), Tube Lines PPP (£7bn).', 'Mark is a well-rounded individual who has the ability to communicate with board members or at an operational level. Mark is an influential leader and has the ability to target key issues whilst developing solutions. He has worked in teams that have negotiated at the highest levels within various Government Departments. Mark''s unique strength is that he has represented major projects from both Client and Contractor perspectives and is therefore able to give a balanced and practical view of risk and performance issues.', '2010-03-29 21:04:56', '2010-03-29 21:04:56')

  def update
    @leadership = Leadership.find(params[:id])

    respond_to do |format|
      if @leadership.update_attributes(params[:leadership])
---
SELECT * FROM "leaderships" WHERE ("leaderships"."id" = 1)
UPDATE "leaderships" SET "avatar_file_name" = 'MT_CapPre_01.png', "avatar_content_type" = 'image/png', "avatar_file_size" = 104384, "avatar_updated_at" = '2010-03-31 23:52:32', "updated_at" = '2010-03-31 23:52:33' WHERE "id" = 1

  def destroy
    @leadership = Leadership.find(params[:id])
    @leadership.destroy
---
SELECT * FROM "leaderships" WHERE ("leaderships"."id" = 6)
DELETE FROM "leaderships" WHERE "id" = 6