app/controllers/admin/pages_controller.rb

SELECT * FROM "pages"
---
  def index
    @pages = Page.all

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def show
    if params[:permalink]
      @page = Page.find_by_permalink(params[:permalink])
      raise ActiveRecord::RecordNotFound, "Page not found" if @page.nil?
    else
      @page = Page.find(params[:id])

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO "pages" ("name", "permalink", "content", "created_at", "updated_at", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at") VALUES('Leadership', 'leadership', '', '2010-04-01 19:46:08', '2010-04-01 19:46:08', 'HdrLeadership.jpg', 'image/jpeg', 19538, '2010-04-01 19:46:08')
---
  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save

SELECT * FROM "pages" WHERE ("pages"."id" = 1)
UPDATE "pages" SET "content" = 'p. More governments and large infrastructure owners around the world are looking for long-term partnering solutions with private companies, backed by private financing, that offer value for money and successfully deliver and enhance their services. This continues to be the approach taken by many industries including <a href="../industries/highways">Highways</a>, Airports, <a href="../industries/rail">Rail</a> (including Metro, Main Line &amp; Light Rail systems), Schools, <a href="../industries/government">Government</a> Buildings and Infrastructure, Bridges, Tunnels, Utilities and Hospitals.
---
  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])

SELECT * FROM "pages" WHERE ("pages"."id" = 46)
DELETE FROM "pages" WHERE "id" = 46
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy