app/controllers/leaderships_controller.rb

SELECT * FROM "leaderships" ORDER BY postion DESC
---
  def index
    @leaderships = Leadership.all(:order => "postion ASC")