app/controllers/users_controller.rb

INSERT INTO "users" ("login", "email", "crypted_password", "password_salt", "persistence_token", "perishable_token", "login_count", "failed_login_count", "last_request_at", "current_login_at", "last_login_at", "current_login_ip", "last_login_ip", "created_at", "updated_at") VALUES('docgecko', 'daren.warburton@apm.eu.com', '5218bf2ed53ffae92a39b56b12aa035a145006fa259bd2fdf0579d4ffcce550c778a91e685480d9663d6a2d9a3e88a4e08d332d468067e3167191c02b72e1ac8', '2c9mfnxTiNryhvq79k7-', 'f8766ea91047df7c33266a00ba4d128447e5ccdfa7c701126bbc60ae962ecbdbb812ac596ebb7b102d56ef274fccc807de8bab83584de2cda7394066c51aebdc', 'mPKuOsXhOpjPLIRSxP77', 1, 0, '2010-04-03 13:29:18', '2010-04-03 13:29:17', NULL, '127.0.0.1', NULL, '2010-04-03 13:29:18', '2010-04-03 13:29:18')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "last_request_at" = '2010-04-03 13:47:47', "perishable_token" = 'zkAhOq0xwOrQMiHMkL9e', "updated_at" = '2010-04-03 13:47:47' WHERE "id" = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])